Repository: Armin83/doc-1
Catalog: source/locale/*/LC_MESSAGES/formcreator/configuration.po
Languages: tr_tr

source: Configuration and usage
tr_tr: Ayarlar ve kullanım

source: Headers
tr_tr: Başlıklar

source: **Menu** : `Setup > Dropdowns : Forms > Headers`
tr_tr: **Menu** : `Kurulum > Açılan Kutular : Formlar > Üst Bilgiler`

source: Headers are rich texts _(text with presentation: bold, italic, titles, colors, etc.)_ which are defined per entities. They can be translated since GLPI 0.85 like all other dropdowns _(Dropdowns translation must be enabled on GLPI general configuration page: Setup > General : General setup > Translate dropdowns = Yes)_.
tr_tr: Başlıklar her varlık için ayrı ayrı tanımlanabilen zengin metinlerdir _(sunum içeren metinler: koyu, yatık, başlıklar, renkler gibi)_. GLPI 0.85 sürümünden itibaren tüm diğer açılan kutular gibi başka dillere çevrilebilirler _(Genel GLPI ayarları sayfasından açılan kutu çevirileri etkinleştirilmiş olmalıdır: Ayarlar > Genel > Genel Ayarlar > Açılan Kutu Çevirileri = Evet)_.

source: These texts are shown on the users forms list, over the forms. It can be used to indicate some general advertisement over all the forms below.
tr_tr: Bu metinler kullanıcılara formların üzerindeki formlar listesinde görüntülenir. Aşağıda görüntülenen formlar ile ilgili genel bilgiler vermek için kullanılabilir.

source: Configuration
tr_tr: Ayarlar

source: Render
tr_tr: Oluşturma

source: Categories
tr_tr: Kategoriler

source: **Menu** : `Setup > Dropdowns : Forms > Form categories`
tr_tr: **Menu** : `Ayarlar > Açılan Kutular : Formlar > Form Kategorileri`

source: Form categories allow you to arrange your forms list.
tr_tr: Form kategorileri form listesinin düzenlenmesini sağlar.

source: You can add or edit categories generally from the Setup menu : `Setup > Dropdowns`.
tr_tr: Kategoriler genel olarak `Ayarlar > Açılan Kutular` menüsünden eklenip düzenlenebilir.

source: You can also add new categories directly from the form page like all GLPI dropdowns.
tr_tr: Ayrıca yeni kategoriler, tüm diğer GLPI açılan kutuları gibi doğrudan form sayfasından eklenebilir.

source: They are defined by entities and can be translated since GLPI 0.85 like all other dropdowns.
tr_tr: Varlıklara göre tanımlanırlar ve GLPI 0.85 sürümünden itibaren tüm diğer açılan kutular gibi başka dillere çevrilebilirler.

source: Dropdowns translation must be enabled on GLPI general configuration page `Setup > General`, `General setup > Translate dropdowns = Yes`
tr_tr: Genel GLPI ayarları sayfasından açılan kutu çevirileri etkinleştirilmiş olmalıdır: `Ayarlar > Genel > Genel Ayarlar > Açılan Kutu Çevirileri = Evet`

source: Questions
tr_tr: Sorular

source: After the creation of a form, create fields for for the user to fill out.
tr_tr: Formu oluşturduktan sonra kullanıcının dolduracağı alanları oluşturun.

source: The name of the questions will appear on the left and the field type selected on the right
tr_tr: Soruların adları solda, seçilmiş alan türü sağda görüntülenir

source: The Description will be under the filed input.
tr_tr: Açıklama doldurulacak alanın altında bulunur.

source: Based on question type options will be based on type chosen.
tr_tr: Seçilen türe göre soru türü seçenekleri görüntülenir.

source: If validation is desired, it can be implemented following `PHP Regular Expressions <http://php.net/manual/reference.pcre.pattern.syntax.php>`_.
tr_tr: Doğrulama istiyorsanız, şu `PHP Kurallı İfadeleri <http://php.net/manual/reference.pcre.pattern.syntax.php>`_ kullanılabilir.

source: Helpdesk
tr_tr: Destek Merkezi

source: The plugin can provide its own design for helpdesk.
tr_tr: Uygulama ekinde kullanılabilecek bir destek merkezi bulunur.

source: To enable it, edit an entity, open the **Forms** tab and set the field **Use Form creator's helpdesk** to **Yes**. This setting handled inheritance from parent entity to children entities.
tr_tr: Etkinleştirmek için, bir varlığı düzenleyin, **Formlar** sekmesini açın ve **Form oluşturucunun destek merkezi kullanılsın* seçeneğini **Evet** olarak işaretleyin. Bu seçenek üst varlıktan alt varlıklara devredilerek geçer.

source: Users using the simplified interface will benefit a new interface allowing them to:
tr_tr: Kullanıcılar basitleştirilmiş yeni arayüzü kullanarak şu olanaklardan yararlanabilir:

source: browse forms and FAQ with the unified interface
tr_tr: aynı arayüzden formlar ve sık sorulan sorulara bakabilmek

source: follow the process of their requests
tr_tr: istekleri üzerinde yapılan işlemleri görmek

source: book assets
tr_tr: varlıkları ayırtmak

source: view their feeds
tr_tr: akışlarına bakmak

source: Forms with **Direct access on homepage** enabled and **FAQ items** in the **Knowledge base** will will appear in the interface. Users may search by browsing the categories on the left of the screen, and may also search for forms or FAQ with a natural language search engine.
tr_tr: **Anasayfadan doğrudan erişlebilsin** ve **Bilgi Bankası** altındaki **SSS ögeleri** seçenekleri etkinleştirilmiş formlar arayüzde görüntülenir. Kullanıcılar sayfanın solundaki kategoriler arasında gezinebilir ve form ya da SSS için kendi dillerinde arama yapabilir.

source: FAQ items needs to be associated to knowledge base categories. The knowledge base categories must be associated to form categories (available in Setup > Dropdowns > Form categories) to show their content.
tr_tr: SSS ögeleri bilgi bankası kategorilerine atanmalıdır. Bilgi bankası kategorileri de içeriklerinin görüntülenmesi için form kategorilerine atanmalıdır (Ayarlar > Açılan kutular > Form kategorileri).
